# Brewfile.minimum — essentials for a fresh Mac. Hand-curated.
# Sister to setup/homebrew/brew-cask-minimum.sh (the install-script journal).
# This file is never auto-regenerated; edit it directly.
#
# Use:  brew bundle install --file=setup/homebrew/Brewfile.minimum

# Taps
tap "hyde46/hoard", trusted: true  # for hoard
tap "nao1215/tap", trusted: true  # for sqly
tap "xykong/tap", trusted: true  # for flux-markdown

# Apps
brew "mas"  # Install App Store command line tools https://github.com/mas-cli/mas

# Favorites
brew "bash"  # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion@2"  # Programmable completion for Bash 4.2+
brew "bat"  # A cat clone with syntax highlighting and Git integration.
brew "diffoscope"  # In-depth comparison of files, archives, and directories can output in friendly HTML https://diffoscope.org
brew "eza"  # A modern replacement for `ls` with more features and better defaults.
brew "fd"  # Simple, fast and user-friendly alternative to find - https://github.com/sharkdp/fd
brew "fselect"  # Find files with SQL-like queries https://github.com/jhspetersson/fselect https://github.com/jhspetersson/fselect/blob/master/docs/usage.md
brew "fzf"  # A general-purpose command-line fuzzy finder.
brew "hyde46/hoard/hoard"  # Hoard is a command-line tool that helps you manage your dotfiles and other configuration files. https://github.com/Hyde46/hoard
brew "jql"  # JSON query language CLI tool https://github.com/yamafaktory/jql
brew "less"  # Pager program similar to more
brew "sq"  # Data wrangler with jq-like query language https://sq.io
brew "nao1215/tap/sqly"  # sqly - execute SQL against CSV, TSV, LTSV, JSON, and even Microsoft Excel™ files brew install https://github.com/nao1215/sqly
brew "television"  # General purpose fuzzy finder TUI https://github.com/alexpasmantier/television
brew "tldr"  # Simplified and community-driven man pages - https://tldr.sh/
brew "zoxide"  # A smarter cd command for navigating your filesystem.
brew "restic"  # Fast, efficient and secure backup program
cask "1password-cli"  # Command-line interface for 1Password
brew "uv"  # Extremely fast Python package installer and resolver, written in Rust https://docs.astral.sh/uv/
brew "pyenv"  # Python version management https://github.com/pyenv/pyenv great for installing multiple versions of python
brew "hub"  # github command line wrapper
brew "micro" # A modern and intuitive terminal-based text editor https://micro-editor.github.io/

# Top Must Installs
cask "1password"
cask "fastscripts"
cask "warp"  # Rust-based terminal app; couldn't get it to work though
cask "obsidian"  # Knowledge base that works on top of a local folder of plain text Markdown files https://obsidian.md/
cask "skim"  # PDF reader and note-taking application https://skim-app.sourceforge.io/
cask "microsoft-edge"
cask "brave-browser"  # Web browser focusing on privacy
cask "comet"  # Web browser with integrated AI assistant
cask "visual-studio-code"
cask "github"  # Desktop client for GitHub repositories
brew "git"  # Distributed revision control system
cask "hookmark"  # Link and retrieve key information https://hookproductivity.com/
cask "claude"  # Anthropic's official Claude AI desktop app
cask "coteditor"  # Plain-text editor for web pages, program source codes and more
cask "markedit"  # Markdown editor
cask "xykong/tap/flux-markdown"  # Markdown editor with live preview and Mermaid support
cask "cyberduck"  # Server and cloud storage browser
cask "mountain-duck"  # Mounts servers and cloud storages as a disk on the desktop
cask "visualdiffer"  # Visually compare folders and files
mas "Juicy", id: 6752221257
mas "OwlOCR", id: 6462355119  # OwlOCR - Screenshot to Text (6.0.6)


# Login items
#cask "bartender"
cask "thaw@beta"  # Menu bar manager
cask "raycast"  # spotlight replacement, deciding between it an alfred
cask "rectangle"
cask "rectangle-pro"  # Window snapping tool
cask "karabiner-elements"
cask "default-folder-x"
cask "betterdisplay"
cask "shottr"  # free screen shot tool; preferred over Monosnap
# cask "typinator"  # PINNED to v9 — homebrew cask is at v10.0; install v9 manually from https://ergonis.com/downloads/ until ready to upgrade.
cask "rocket-typist"  # Text expander for common phrases https://witt-software.com/rockettypist/
# installing office makes this too heavyweight yet I can't install onedrive as the brew casks conflict. So have to remember to manually install this if I need onedrive.
#cask "microsoft-office"  # requires admin password to install; best way to install best office and onedrive.
#cask "onedrive"  # Folder synchronization with OneDrive; required you pass cask; this conflicts with microsoft-office cask
mas "OwlOCR", id: 6462355119  # OwlOCR - Screenshot to Text (6.0.6)
mas "Velja", id: 1607635845  # Velja (1.10.1) - browser picker: Open links in a specific browser or a matching native app. Easily switch between browsers
