# Brewfile.homeserver — CLI tools, dev tools, AI/LLM CLIs, networking,
# and system utilities. Useful on a headless box. Hand-curated.
# This file is never auto-regenerated; edit it directly.
#
# Cascade: install AFTER Brewfile.minimum. The two together give a fully
# functional headless setup; entries here intentionally exclude anything
# already in Brewfile.minimum (mas, bash, bat, eza, fd, fzf, hoard, jql,
# less, sq, sqly, television, tldr, zoxide, restic, uv, pyenv, hub, git).
#
# Use:  brew bundle install --file=setup/homebrew/Brewfile.homeserver

# Taps (CLI-providing)
tap "bramstein/webfonttools"  # for sfnt2woff, sfnt2woff-zopfli
tap "ebullient/tap"  # for ttrpg-convert-cli
tap "hashicorp/tap"  # for terraform
tap "ionos-cloud/ionos-cloud"  # for ionosctl
tap "oven-sh/bun"  # for bun
tap "sontek/snowmachine"  # for snowmachine

# Favorites (CLI extras beyond minimum)
brew "fswatch"  # Monitor a directory for changes and run a shell command https://github.com/emcrisostomo/fswatch
brew "rclone"  # Rsync for cloud storage https://rclone.org/
brew "rmlint"  # Tool to find and remove duplicate files and other lint from your filesystem. https://rmlint.readthedocs.io/
brew "rsync-time-backup"  # Time Machine-style backup for the terminal using rsync https://github.com/laurent22/rsync-time-backup

# Additional Tools
brew "arp-scan"  # ARP scanning and fingerprinting tool https://github.com/royhills/arp-scan
brew "atac"  # Simple API client (Postman-like) in your terminal https://atac.julien-cpsn.com/
brew "direnv"  # An environment switcher for the shell.
brew "dos2unix"  # Convert text between DOS, UNIX, and Mac formats https://waterlan.home.xs4all.nl/dos2unix.html
brew "gh"  # github cli - https://cli.github.com/
brew "monolith"  # CLI tool for saving complete web pages as a single HTML file https://github.com/Y2Z/monolith
brew "pyenv-virtualenv"  # pyenv plugin to manage virtualenv
brew "rich-cli"  # Command-line toolbox for fancy output in the terminal https://github.com/textualize/rich-cli
brew "ripgrep"  # command is "rg" A line-oriented search tool that recursively searches your current directory for a regex pattern. https://github.com/BurntSushi/ripgrep
brew "ripgrep-all"  # command is "rga" ripgrep-all is a wrapper around ripgrep that adds support for searching inside binary files, PDFs, and other file formats. https://github.com/phiresky/ripgrep-all
brew "hashicorp/tap/terraform"  # Terraform
brew "thefuck"  # Corrects errors in previous console commands.
brew "tmux"  # A terminal multiplexer that allows multiple terminal sessions to be accessed simultaneously.
brew "xpdf"  # PDF viewer (CLI tools: pdftotext, pdfinfo, etc.)
brew "yadm"  # A tool for managing dotfiles.

# cloud tools
brew "azure-cli"  # Microsoft Azure CLI 2.0
brew "doctl"  # Command-line tool for DigitalOcean
brew "ionos-cloud/ionos-cloud/ionosctl"  # IonosCTL — manage IONOS CLOUD resources from your terminal.

# S3 storage commands
brew "duti"  # Select default apps for documents and URL schemes on macOS - https://github.com/moretension/duti/
brew "s3cmd"  # Command-line tool for the Amazon S3 service https://s3tools.org/s3cmd
brew "s4cmd"  # Super S3 command-line tool https://github.com/bloomreach/s4cmd

# kubernetes / runtimes
brew "oven-sh/bun/bun"  # Bun is a fast all-in-one JavaScript runtime - https://bun.sh/
brew "go"  # Open source programming language to build simple/reliable/efficient software
brew "kafka"  # Open-source distributed event streaming platform
brew "kubectx"  # Tool that can switch between kubectl contexts easily and create aliases
brew "kubernetes-cli"  # Kubernetes command-line interface
brew "node"  # Open-source, cross-platform JavaScript runtime environment
brew "nvm"  # Node Version Manager — invoked per-shell.
brew "pnpm"  # pnpm is a fast, disk space-efficient package manager https://pnpm.io/
brew "spark"  # Sparklines for the shell

# Rust installation
brew "rust"  # Rust is a systems programming language https://www.rust-lang.org/
brew "switchaudio-osx"  # Change macOS audio source from the command-line

# data science
brew "nbdime"  # diffing and merging of Jupyter Notebooks

# python packaging tools
brew "pipx"  # Execute binaries from Python packages in isolated environments https://pipx.pypa.io
brew "poetry"  # Python dependency management and packaging made easy https://python-poetry.org/
# (CLI AI tools moved to Brewfile.ai)

# cli resource usage tools
brew "bandwhich"  # Terminal bandwidth utilization tool
brew "btop"  # Resource monitor for processor, memory, disks, network & processes. https://github.com/aristocratos/btop
brew "glances"  # Cross-platform system monitoring tool https://nicolargo.github.io/glances/
brew "gotop"  # Terminal based graphical activity monitor inspired by gtop and vtop
brew "iftop"  # Display bandwidth usage on an interface
brew "nethogs"  # Net top tool grouping bandwidth per process
brew "nload"  # Network traffic and bandwidth usage monitor

# network scanner / misc CLI
brew "asciinema"  # Record and share terminal sessions https://asciinema.org
brew "blueutil"  # Get/set bluetooth power and discoverable state https://github.com/toy/blueutil
brew "cmatrix"  # Console Matrix (like the movie Matrix) https://github.com/abishekvashok/cmatrix/
brew "exiftool"  # Perl lib for reading and writing EXIF metadata https://exiftool.org
brew "gping"  # Ping, but with a graph https://github.com/orf/gping
brew "harfbuzz"  # An OpenType text shaping engine https://harfbuzz.github.io/
brew "jpdfbookmarks"  # Create and edit bookmarks on existing PDF files https://sourceforge.net/projects/jpdfbookmarks/
brew "lftp"  # Sophisticated file transfer program https://lftp.yar.ru/
brew "midnight-commander"  # Visual file manager, similar to Norton Commander.
brew "mplayer"  # UNIX movie player https://mplayerhq.hu/
brew "ncdu"  # NCurses Disk Usage https://dev.yorhel.nl/ncdu
brew "pwgen"  # Password generator https://pwgen.sourceforge.io/
brew "s-search"  # Web search from the terminal https://github.com/zquestz/s
brew "shfmt"  # Autoformat shell script source code https://github.com/mvdan/sh
brew "sleepwatcher"  # Monitors sleep, wakeup, and idleness of a Mac
brew "sontek/snowmachine/snowmachine"  # Snow effect in the terminal. https://github.com/sontek/snowmachine
brew "termshot"  # Capture terminal output as images https://github.com/iamcco/termshot
brew "tesseract"  # OCR (Optical Character Recognition) engine https://github.com/tesseract-ocr/
brew "ebullient/tap/ttrpg-convert-cli"  # Utility to convert 5eTools and Pf2eTools JSON data into Markdown
brew "wifi-password"  # Show the current WiFi network password https://github.com/rauchg/wifi-password

# tiling windows managers (CLI tools)
brew "duck"  # CLI for Cyberduck (multi-protocol file transfer) - https://duck.sh/

# cli CardDav and CalDav clients
brew "khard"  # Console carddav client https://github.com/lucc/khard
brew "vdirsyncer"  # Synchronize calendars and contacts https://github.com/pimutils/vdirsyncer

# Markdown
brew "marked"  # Markdown parser and compiler built for speed

# Utilities (CLI)
brew "handbrake"  # https://handbrake.fr/ (CLI: HandBrakeCLI)
brew "monit"  # Manage and monitor processes, files, directories https://mmonit.com/monit/

# terminal utilities
brew "terminal-notifier"  # Send macOS notifications from the command line

# diff tools
brew "gitup"  # Visualization Tool for Git
brew "powershell", link: false  # Command-line shell and scripting language https://github.com/PowerShell/PowerShell

# WordPress
brew "wp-cli"  # Command line interface for WordPress https://wp-cli.org/
brew "wp-cli-completion"  # Bash completion for Wpcli https://github.com/wp-cli/wp-cli

# (CLI AI / model-serving tools moved to Brewfile.ai)

# cloudflare tools
brew "cloudflare-cli4"  # Cloudflare CLI for managing Cloudflare services
brew "cloudflare-speed-cli"  # Cloudflare network speed test from the terminal
brew "cloudflared"  # Cloudflare Tunnel — expose local server to the internet without opening ports

# dev tools added recently
brew "ansible"  # Automate deployment, configuration, and upgrading
brew "asciidoc"  # Formatter/translator for text files to numerous formats
brew "cairo"  # Vector graphics library with cross-device output support
#brew "cask"  # Emacs dependency management
brew "colordiff"  # Color-highlighted diff(1) output
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "couchdb"  # Apache CouchDB database server
brew "csshx"  # Cluster ssh tool for Terminal.app
brew "dependency-check"  # OWASP dependency-check
brew "diffutils"  # File comparison utilities
#brew "docbook"  # Standard XML representation system for technical documents
brew "docker"  # Pack, ship and run any application as a lightweight container
brew "emacs"  # GNU Emacs text editor
brew "erlang"  # Programming language for highly scalable real-time systems
brew "fetchmail"  # Client for fetching mail from POP, IMAP, ETRN or ODMR-capable servers
brew "flow"  # Static type checker for JavaScript
brew "fontconfig"  # XML-based font configuration API for X Windows
brew "fpp"  # CLI program that accepts piped input and presents files for selection
brew "freetype"  # Software library to render fonts
brew "gawk"  # GNU awk utility
brew "gcc"  # GNU compiler collection
brew "gdbm"  # GNU database manager
brew "gettext"  # GNU internationalization (i18n) and localization (l10n) library
brew "git-extras"  # Small git utilities
brew "glib"  # Core application library for C
brew "gmp"  # GNU multiple precision arithmetic library
brew "gnu-sed"  # GNU implementation of the famous stream editor
brew "gnu-tar"  # GNU version of the tar archiving utility
brew "gnu-which"  # GNU implementation of which utility
brew "graphicsmagick"  # Image processing tools collection
brew "graphviz"  # Graph visualization software from AT&T and Bell Labs
brew "grep"  # GNU grep, egrep and fgrep
brew "gzip"  # Popular GNU data compression program
brew "httpie"  # User-friendly cURL replacement (command-line HTTP client)
brew "icdiff"  # Improved colored diff
brew "isl"  # Integer Set Library for the polyhedral model
brew "jpeg"  # Image manipulation library
brew "jq"  # Lightweight and flexible command-line JSON processor
brew "libevent"  # Asynchronous event library
brew "libffi"  # Portable Foreign Function Interface library
brew "libmpc"  # C library for the arithmetic of high precision complex numbers
brew "libpng"  # Library for manipulating PNG images
brew "libtiff"  # TIFF library and utilities
brew "libtool"  # Generic library support script
brew "libyaml"  # YAML Parser
brew "logstash"  # Tool for managing events and logs
brew "lynx"  # Text-based web browser
brew "memcached"  # High performance, distributed memory object caching system
brew "moreutils"  # Collection of tools that nobody wrote when UNIX was young
brew "mpfr"  # C library for multiple-precision floating-point computations
brew "mr"  # Multiple Repository management tool
brew "multimarkdown"  # Turn marked-up plain text into well-formatted documents
brew "multitail"  # Tail multiple files in one terminal simultaneously
brew "mysql"  # Open source relational database management system
brew "nspr"  # Platform-neutral API for system-level and libc-like functions
brew "pandoc"  # Swiss-army knife of markup format conversion
brew "pcre"  # Perl compatible regular expressions library
brew "pixman"  # Low-level library for pixel manipulation
brew "procmail"  # Autonomous mail processor
brew "qt"  # Cross-platform application and UI framework
brew "r"  # Software environment for statistical computing
brew "readline"  # Library for command-line editing
brew "redis"  # Persistent key-value database, with built-in net interface
brew "rsync"  # Utility that provides fast incremental file transfer
brew "sbt"  # Build tool for Scala projects
#brew "scala"  # JVM-based programming language
brew "sfml"  # Multi-media library with bindings for multiple languages
brew "shellcheck"  # Static analysis and lint tool, for (ba)sh scripts
brew "spidermonkey"  # JavaScript-C Engine
brew "ssh-copy-id"  # Add a public key to a remote machine's authorized_keys file
brew "ssldump"  # SSLv3/TLS network protocol analyzer
brew "sslscan"  # Test SSL/TLS enabled services to discover supported cipher suites
#brew "subversion"  # Version control system designed to be a better CVS
brew "tcpstat"  # Active TCP connections monitoring tool
brew "the_silver_searcher"  # fast source code searching with "ag"
brew "tig"  # Text interface for Git repositories
brew "tree"  # Display directories as trees (with optional color/HTML output)
brew "unixodbc"  # ODBC 3 connectivity for UNIX
brew "vim"  # Vi 'workalike' with many additional features
brew "wdiff"  # Display word differences between text files
brew "xz"  # General-purpose data compression with high compression ratio
brew "z"  # Tracks most-used directories to make cd smarter
brew "zsh"  # UNIX shell (command interpreter)
brew "zsh-completions"  # Additional completion definitions for zsh
brew "zsh-history-substring-search"  # Zsh port of Fish shell's history search
brew "zsh-lovers"  # Tips, tricks, and examples for zsh
brew "zsh-syntax-highlighting"  # Fish shell like syntax highlighting for zsh

# Development tools
brew "docker-compose"  # tool for defining and running multi-container applications with Docker
#brew "groovy"  # Groovy: a Java-based scripting language
#brew "jenkins"  # CI Server
#brew "maven"  # Java-based project management
#brew "maven-completion"  # maven-bash-completion
brew "reattach-to-user-namespace"  # work around for tmux-related pasteboard problems https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard

# Work-machine additions (CLI build tooling — also generally useful)
brew "docker-completion"  # Shell completion for Docker
brew "dotnet"             # .NET SDK
brew "llvm"               # LLVM toolchain
brew "m4"                 # GNU macro processor (build tooling dep)
brew "php"                # PHP
brew "protobuf"           # Protocol Buffers
brew "scala-cli"          # Modern Scala CLI tool
brew "sqlite"             # SQLite database engine
brew "tcl-tk"             # Tcl/Tk scripting + GUI toolkit
brew "z3"                 # Z3 theorem prover

# (not in source scripts — discovered via brew bundle dump)
brew "ack"  # Search tool like grep, but optimized for programmers
brew "bfg"  # Remove large files or passwords from Git history like git-filter-branch
brew "binutils"  # GNU binary tools for native development
brew "binwalk"  # Searches a binary image for embedded files and executable code
brew "cifer"  # Work on automating classical cipher cracking in C
brew "dark-mode"  # Control the macOS dark mode from the command-line
brew "dash-shell"  # POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
#brew "dex2jar"  # Tools to work with Android .dex and Java .class files
brew "dns2tcp"  # TCP over DNS tunnel
#brew "fcrackzip"  # Zip password cracker
#brew "john"  # Featureful UNIX password cracker
brew "findutils"  # Collection of GNU find, xargs, and locate
brew "foremost"  # Console program to recover files based on their headers and footers
brew "git-delta"  # Syntax-highlighting pager for git and diff output
brew "git-lfs"  # Git extension for versioning large files
brew "htop"  # Improved top (interactive process viewer)
brew "hydra"  # Network logon cracker which supports many services
brew "imagemagick"  # Tools and libraries to manipulate images in select formats
brew "jupyterlab"  # Interactive environments for writing and running code
brew "knock"  # Port-knock server
brew "lua"  # Powerful, lightweight programming language
brew "netpbm"  # Image manipulation
brew "nmap"  # Port scanning utility for large networks
brew "p7zip"  # 7-Zip (high compression file archiver) implementation
brew "pigz"  # Parallel gzip
brew "pkgconf"  # Package compiler and linker metadata toolkit
brew "pngcheck"  # Print info and check PNG, JNG, and MNG files
brew "pv"  # Monitor data's progress through a pipe
brew "python@3.14"  # Interpreted, interactive, object-oriented programming language
brew "rename"  # Perl-powered file rename script with many helpful built-ins
brew "rhino"  # JavaScript engine
brew "ringojs"  # CommonJS-based JavaScript runtime
brew "bramstein/webfonttools/sfnt2woff"  # Convert existing TrueType/OpenType fonts to WOFF format
brew "bramstein/webfonttools/sfnt2woff-zopfli"  # WOFF utilities with Zopfli compression
#brew "sloth-cli"  # Prometheus SLO generator
brew "socat"  # SOcket CAT: netcat on steroids
brew "speedtest-cli"  # Command-line interface for https://speedtest.net bandwidth tests
brew "sqlmap"  # Penetration testing for SQL injection and database servers
brew "tcpflow"  # TCP/IP packet demultiplexer
brew "tcpreplay"  # Replay saved tcpdump files at arbitrary speeds
#brew "tcptrace"  # Analyze tcpdump output # Formula no longer exists.
brew "testssl"  # Tool which checks for the support of TLS/SSL ciphers and flaws
brew "ucspi-tcp"  # `tcpserver` etc.
brew "vbindiff"  # Visual Binary Diff
brew "webkit2png"  # Create screenshots of webpages from the terminal
brew "woff2"  # Utilities to create and convert Web Open Font File (WOFF) files
brew "wxwidgets"  # Cross-platform C++ GUI toolkit
brew "zopfli"  # New zlib (gzip, deflate) compatible compressor
